{comment: 主歌A}
[A]迟了听你细诉你曾迷途和那理想[E]跟前途 多么糊涂
[F#m]迟了半秒约你晚饭漫步在那海滨[Cm#]公园一双足印如同共舞
这[D]恋爱的信徒 再一次失去爱神怜悯 [E]一次要被遗下在半途


[A]迟了送上雨伞 雨仍毛毛谁与你竟[E]早潜逃 终于徒劳
[F#m]迟了爱你替你抹掉问号 迟了抱紧[Cm#]双手差点经已同行共老
这[D]恋爱的旅途 我想要得到却未拾到 
[E]多么糟可给我为[A]你填补

{comment: 副歌}

[A]昨日像得到
[E]迟来无去路
[F#m]给你与某人在[Cm#]长夜共抱
[D]只懂得安慰或[A]时候未到
[Bm]天未亮都需要为你虚耗
[A]陪我细诉 [E]和我抱抱
为何[F#m]天空一个[Cm#]城堡
[D]仰望却无法触到 [A]盖着被铺
仿似[Bm]终得到安土[E]
笑着投入[A]你的怀抱

{comment: 主歌B}
[A]迟了吻你两片软唇红红而那眼睛[E]都红红 心中重重
[F#m]迟了疼你与你抱著做梦直到昨天[Cm#]分手 只懂一个呆呆目送
今[D]天我一个人
再一次失去爱神护荫 
[E]今天他 当天你 如何残忍



{comment: 副歌}

[A]昨日像得到
[E]迟来无去路
[F#m]给你与某人在[Cm#]长夜共抱
[D]只懂得安慰或[A]时候未到
[Bm]天未亮都需要为你虚耗
[A]陪我细诉 [E]和我抱抱
为何[F#m]天空一个[Cm#]城堡
[D]仰望却无法触到 [A]盖着被铺
仿似[Bm]终得到安土[E]
笑着投入[A]你的怀抱

{comment: 还差一段bridge}
我会祝福你安好 快乐投入那些怀抱
